feat: two new articles Hot Paths & Percentiles
